Eamcs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org79d0d0d">Helpfull Packages</a>
<ul>
<li><a href="#org49fa1ab">youtube-sub-extractor</a>
<ul>
<li><a href="#org0f2aab2"><span class="done DONE">DONE</span> 1) Download package from home page [devops]</a></li>
<li><a href="#org18c74d8">2) Installation</a></li>
<li><a href="#org79e30c2">Usage: yt</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org79d0d0d" class="outline-2">
<h2 id="org79d0d0d">Helpfull Packages</h2>
<div class="outline-text-2" id="text-org79d0d0d">
</div>
<div id="outline-container-org49fa1ab" class="outline-3">
<h3 id="org49fa1ab">youtube-sub-extractor</h3>
<div class="outline-text-3" id="text-org49fa1ab">
</div>
<div id="outline-container-org0f2aab2" class="outline-4">
<h4 id="org0f2aab2"><span class="done DONE">DONE</span> 1) Download package from home page [devops]</h4>
<div class="outline-text-4" id="text-org0f2aab2">
<ul class="org-ul">
<li>mkdir ~/.emacs.d/Lisp</li>
<li>cd <i>~/</i>.emacs.d/Lisp</li>
<li>git clone <a href="https://github.com/agzam/youtube-sub-extractor.el.git">https://github.com/agzam/youtube-sub-extractor.el.git</a></li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orgf1b6acd"></a><span class="done DONE">DONE</span> Warning :<br />
<div class="outline-text-5" id="text-orgf1b6acd">
<ul class="org-ul">
<li>Here we changed the cloned directory name from youtube-sub-extractor.el to youtube-sub-extractor (deleting the 'el')</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org18c74d8" class="outline-4">
<h4 id="org18c74d8">2) Installation</h4>
<div class="outline-text-4" id="text-org18c74d8">
<ul class="org-ul">
<li>If you download Emacs Lisp files yourself or you write local Lisp files, just add the directories containing those files to ‘load-path’. [Ref:<a href="https://www.emacswiki.org/emacs/LoadPath">Link</a>]</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'load-path <span style="font-style: italic;">"/home/cuore-pc/.emacs.d/Lisp/youtube-sub-extractor"</span>)
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">youtube-sub-extractor</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org79e30c2" class="outline-4">
<h4 id="org79e30c2">Usage: yt</h4>
<div class="outline-text-4" id="text-org79e30c2">
<p>
M-x yt-extract-subs
</p>

<p>
commit is done
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
